In [26]:
import os 
import json
import pandas as pd

In [76]:
def calculate_sum_cm(cm):
    res = 0
    for i in cm:
        res += sum(i)
    return res

def calculate_acc_cm(cm):
    female_acc = round(calculate_female_acc(cm), 2)
    male_acc = round(calculate_male_acc(cm), 2)
    return (female_acc + male_acc) / 2

def calculate_female_acc(cm):
    female_row = cm[0]
    return (female_row[0] / (female_row[0] + female_row[1]))*100
    
def calculate_male_acc(cm):
    male_row = cm[1]
    return (male_row[1] / (male_row[0] + male_row[1]))*100

In [82]:
"""
Get average across all sets
"""
all_dfs = []
model_type = 'dense'
new_v = [1,5,8,10] 
for set_no in new_v:
    # print("Set no:", set_no)
    directory = 'cr_cm_results/set{}/'.format(set_no)
    gender = 'bothg'
    perturbations = ['ori', 'glasses', 'masked', 'makeup']
    #for filename in os.listdir(directory):
    res = {}
    if filename != ".ipynb_checkpoints":
        row = []
        for perturbation in perturbations:
            # print("cr_cm_{}_{}_{}".format(model_type, perturbation, gender))
            with open(directory + "cr_cm_{}_{}_{}".format(model_type, perturbation, gender)) as json_file:
                data = json.load(json_file)
                data = json.loads(data)
            cm = data["cm_{}_{}".format(model_type, gender)]
            all_acc = round(calculate_acc_cm(cm), 2)
            female_acc = round(calculate_female_acc(cm), 2)
            male_acc = round(calculate_male_acc(cm), 2)
            row = [all_acc, female_acc, male_acc]
            # print("Both Gender Acc:", all_acc)
            # print("Female cm:", female_acc)
            # print("Male cm:", male_acc)
            # print("----------------------")
            res[perturbation] = row
    df = pd.DataFrame(data=res)
    all_dfs.append(df)

In [83]:
all_dfs[0]

     ori  glasses  masked  makeup
0  85.40    70.26    66.7    76.1
1  86.77    51.37    78.2    94.2
2  84.03    89.15    55.2    58.0

In [84]:
all_dfs[1]

     ori  glasses  masked  makeup
0  85.02    73.44   59.23   69.25
1  84.24    73.75   96.49   98.27
2  85.79    73.13   21.97   40.23

In [85]:
all_dfs[2]

     ori  glasses  masked  makeup
0  85.34    74.19   62.73   72.65
1  82.58    75.71   91.64   95.49
2  88.11    72.66   33.83   49.81

In [86]:
all_dfs[3]

     ori  glasses  masked  makeup
0  84.52    72.69   66.97   79.63
1  83.98    62.33   65.67   87.24
2  85.06    83.05   68.26   72.02